StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_ap.c
					SET_HT_OP_ELE_STA_CHL_WIDTH(pht_info, 1);

					SET_HT_OP_ELE_2ND_CHL_OFFSET(pht_info,
								     (pmlmeext->cur_ch_offset == HAL_PRIME_CHNL_OFFSET_LOWER) ?
								     HT_INFO_HT_PARAM_SECONDARY_CHNL_ABOVE : HT_INFO_HT_PARAM_SECONDARY_CHNL_BELOW);

					pmlmepriv->sw_to_20mhz = 0;
					/*
					sta_info_update_type |= STA_INFO_UPDATE_BW;
					beacon_updated = _TRUE;
					*/

					RTW_INFO("%s:switching back to 40Mhz\n", __FUNCTION__);
				}
			}
		}

		/* to update  ht_op_mode*/
		*(u16 *)(pht_info->infos + 1) = cpu_to_le16(pmlmepriv->ht_op_mode);

	}

	/*associated_clients_update(padapter, beacon_updated, sta_info_update_type);*/
#endif /* CONFIG_80211N_HT */
}

static void update_bcn_rsn_ie(_adapter *padapter)
{
	RTW_INFO("%s\n", __FUNCTION__);

}

static void update_bcn_wpa_ie(_adapter *padapter)
{
	RTW_INFO("%s\n", __FUNCTION__);

}

static void update_bcn_wmm_ie(_adapter *padapter)
{
	RTW_INFO("%s\n", __FUNCTION__);

}

static void update_bcn_wps_ie(_adapter *padapter)
{
	u8 *pwps_ie = NULL, *pwps_ie_src, *premainder_ie, *pbackup_remainder_ie = NULL;
	uint wps_ielen = 0, wps_offset, remainder_ielen;
	struct mlme_priv *pmlmepriv = &(padapter->mlmepriv);
	struct mlme_ext_priv	*pmlmeext = &(padapter->mlmeextpriv);
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	WLAN_BSSID_EX *pnetwork = &(pmlmeinfo->network);
	unsigned char *ie = pnetwork->IEs;
	u32 ielen = pnetwork->IELength;


	RTW_INFO("%s\n", __FUNCTION__);

	pwps_ie = rtw_get_wps_ie(ie + _FIXED_IE_LENGTH_, ielen - _FIXED_IE_LENGTH_, NULL, &wps_ielen);

	if (pwps_ie == NULL || wps_ielen == 0) {
		return;
	}

	pwps_ie_src = pmlmepriv->wps_beacon_ie;
	if (pwps_ie_src == NULL) {
		return;
	}

	wps_offset = (uint)(pwps_ie - ie);

	premainder_ie = pwps_ie + wps_ielen;

	remainder_ielen = ielen - wps_offset - wps_ielen;

	if (remainder_ielen > 0) {
		pbackup_remainder_ie = rtw_malloc(remainder_ielen);
		if (pbackup_remainder_ie) {
			_rtw_memcpy(pbackup_remainder_ie, premainder_ie, remainder_ielen);
		}
	}

	wps_ielen = (uint)pwps_ie_src[1];/* to get ie data len */
	if ((wps_offset + wps_ielen + 2 + remainder_ielen) <= MAX_IE_SZ) {
		_rtw_memcpy(pwps_ie, pwps_ie_src, wps_ielen + 2);
		pwps_ie += (wps_ielen + 2);

		if (pbackup_remainder_ie) {
			_rtw_memcpy(pwps_ie, pbackup_remainder_ie, remainder_ielen);
		}

		/* update IELength */
		pnetwork->IELength = wps_offset + (wps_ielen + 2) + remainder_ielen;
	}

	if (pbackup_remainder_ie) {
		rtw_mfree(pbackup_remainder_ie, remainder_ielen);
	}

	/* deal with the case without set_tx_beacon_cmd() in update_beacon() */
#if defined(CONFIG_INTERRUPT_BASED_TXBCN) || defined(CONFIG_AXI_HCI)
	if ((pmlmeinfo->state & 0x03) == WIFI_FW_AP_STATE) {
		u8 sr = 0;
		rtw_get_wps_attr_content(pwps_ie_src,  wps_ielen, WPS_ATTR_SELECTED_REGISTRAR, (u8 *)(&sr), NULL);

		if (sr) {
			set_fwstate(pmlmepriv, WIFI_UNDER_WPS);
			RTW_INFO("%s, set WIFI_UNDER_WPS\n", __func__);
		} else {
			clr_fwstate(pmlmepriv, WIFI_UNDER_WPS);
			RTW_INFO("%s, clr WIFI_UNDER_WPS\n", __func__);
		}
	}
#endif
}

static void update_bcn_p2p_ie(_adapter *padapter)
{

}

static u8 update_csa_ie(_adapter *padapter)
{
	_adapter *linking_adapter;
	struct mlme_priv *pmlmepriv = &(padapter->mlmepriv);
	struct mlme_ext_priv *pmlmeext = &(padapter->mlmeextpriv);
	struct mlme_ext_info *pmlmeinfo = &(pmlmeext->mlmext_info);
	struct dvobj_priv *dvobj = adapter_to_dvobj(padapter);
	struct rf_ctl_t *rfctl = dvobj_to_rfctl(dvobj);
	WLAN_BSSID_EX *pnetwork = &(pmlmeinfo->network);
	sint ie_len = 0;
	unsigned char	*pbuf;
	u8 update = _FALSE;
	u8 *ie = pnetwork->IEs;
	u8 csa_data[WLAN_EID_CSA_IE_LEN] = {0}, ifbmp = 0;

	if (rfctl->ap_csa_en == AP_CSA_DISABLE || rfctl->ap_csa_en == CSA_IE_REMOVE) {
		return update;
	}

	csa_data[CSA_NEW_CH] = rfctl->ap_csa_ch;
	csa_data[CSA_SWITCH_COUNT] = rfctl->ap_csa_switch_cnt;

	pbuf = rtw_get_ie(ie + _BEACON_IE_OFFSET_, WLAN_EID_CHANNEL_SWITCH \
			  , &ie_len, (pnetwork->IELength - _BEACON_IE_OFFSET_));

	if (pbuf && ie_len == WLAN_EID_CSA_IE_LEN && csa_data[CSA_SWITCH_COUNT] > 0) {
		/* RTW_INFO("%s, ch=%d, switch_count=%d, update CSA IE\n", __FUNCTION__,
			csa_data[CSA_NEW_CH], csa_data[CSA_SWITCH_COUNT]); */
		pbuf[4] = rfctl->ap_csa_switch_cnt;
		update = _TRUE;
	} else if (!pbuf && csa_data[CSA_SWITCH_COUNT] > 0) {
		RTW_INFO("%s, ch=%d, switch_count=%d, add CSA IE\n", __FUNCTION__\
			 , csa_data[CSA_NEW_CH], csa_data[CSA_SWITCH_COUNT]);
		rtw_add_bcn_ie(padapter, pnetwork, WLAN_EID_CHANNEL_SWITCH, csa_data, WLAN_EID_CSA_IE_LEN);
		update = _TRUE;
	} else if (pbuf && ie_len > 0 && csa_data[CSA_SWITCH_COUNT] == 0) {
		RTW_INFO("%s, ch=%d, switch_count=%d, remove CSA IE\n", __FUNCTION__ \
			 , csa_data[CSA_NEW_CH], csa_data[CSA_SWITCH_COUNT]);

		if (pbuf) {
			rtw_remove_bcn_ie(padapter, pnetwork, WLAN_EID_CHANNEL_SWITCH);
			update = _TRUE;
		}

		if (rfctl->ap_csa_en == AP_SWITCH_CH_CSA) {
			ifbmp = BIT(padapter->iface_id);
			rtw_change_bss_chbw_cmd(padapter, 0, ifbmp, 0, rfctl->ap_csa_ch, rfctl->ap_csa_ch_width, rfctl->ap_csa_ch_offset);
			rfctl->ap_csa_en = CSA_IE_REMOVE;
		}
#ifdef CONFIG_CONCURRENT_MODE
		else if (rfctl->ap_csa_en == CSA_STA_JOINBSS) {
			linking_adapter = rtw_mi_get_linking_adapter(padapter);
			if (linking_adapter) {
				rfctl->ap_csa_en = CSA_IE_REMOVE;
				pmlmepriv = &(linking_adapter->mlmepriv);
				rtw_joinbss_cmd(linking_adapter, &(pmlmepriv->candidate_network));
			} else {
				RTW_ERR("Can't find the linking STA\n");
			}
		}
#endif
	} else {
		RTW_INFO("%s, unexpected case\n", __FUNCTION__);
	}

	if (rfctl->ap_csa_switch_cnt > 0) {
		rfctl->ap_csa_switch_cnt--;
	}

	return update;
}

static void update_bcn_vendor_spec_ie(_adapter *padapter, u8 *oui)
{
	RTW_INFO("%s\n", __FUNCTION__);

	if (_rtw_memcmp(RTW_WPA_OUI, oui, 4)) {
		update_bcn_wpa_ie(padapter);
	} else if (_rtw_memcmp(WMM_OUI, oui, 4)) {
		update_bcn_wmm_ie(padapter);
	} else if (_rtw_memcmp(WPS_OUI, oui, 4)) {
		update_bcn_wps_ie(padapter);
	} else if (_rtw_memcmp(P2P_OUI, oui, 4)) {
		update_bcn_p2p_ie(padapter);
	} else {
		RTW_INFO("unknown OUI type!\n");
	}


