StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_ap.c
		/* update ht cap ie */
		if (ht_cap_ie && ht_cap_ielen) {
#if UPDATE_HT_CAP
			if (bw >= CHANNEL_WIDTH_40) {
				SET_HT_CAP_ELE_CHL_WIDTH(ht_cap_ie + 2, 1);
			} else {
				SET_HT_CAP_ELE_CHL_WIDTH(ht_cap_ie + 2, 0);
			}

			if (bw >= CHANNEL_WIDTH_40 && htpriv->sgi_40m) {
				SET_HT_CAP_ELE_SHORT_GI40M(ht_cap_ie + 2, 1);
			} else {
				SET_HT_CAP_ELE_SHORT_GI40M(ht_cap_ie + 2, 0);
			}

			if (htpriv->sgi_20m) {
				SET_HT_CAP_ELE_SHORT_GI20M(ht_cap_ie + 2, 1);
			} else {
				SET_HT_CAP_ELE_SHORT_GI20M(ht_cap_ie + 2, 0);
			}
#endif
		}

		/* update ht op ie */
		if (ht_op_ie && ht_op_ielen) {
			SET_HT_OP_ELE_PRI_CHL(ht_op_ie + 2, ch);
			switch (offset) {
			case HAL_PRIME_CHNL_OFFSET_LOWER:
				SET_HT_OP_ELE_2ND_CHL_OFFSET(ht_op_ie + 2, SCA);
				break;
			case HAL_PRIME_CHNL_OFFSET_UPPER:
				SET_HT_OP_ELE_2ND_CHL_OFFSET(ht_op_ie + 2, SCB);
				break;
			case HAL_PRIME_CHNL_OFFSET_DONT_CARE:
			default:
				SET_HT_OP_ELE_2ND_CHL_OFFSET(ht_op_ie + 2, SCN);
				break;
			}

			if (bw >= CHANNEL_WIDTH_40) {
				SET_HT_OP_ELE_STA_CHL_WIDTH(ht_op_ie + 2, 1);
			} else {
				SET_HT_OP_ELE_STA_CHL_WIDTH(ht_op_ie + 2, 0);
			}
		}
	}
#endif /* CONFIG_80211N_HT */
}

static u8 rtw_ap_update_chbw_by_ifbmp(struct dvobj_priv *dvobj, u8 ifbmp
				      , u8 cur_ie_ch[], u8 cur_ie_bw[], u8 cur_ie_offset[]
				      , u8 dec_ch[], u8 dec_bw[], u8 dec_offset[]
				      , const char *caller)
{
	struct rf_ctl_t *rfctl = dvobj_to_rfctl(dvobj);
	_adapter *iface;
	struct mlme_ext_priv *mlmeext;
	WLAN_BSSID_EX *network;
	u8 ifbmp_ch_changed = 0;
	int i;

	for (i = 0; i < dvobj->iface_nums; i++) {
		if (!(ifbmp & BIT(i)) || !dvobj->padapters[i]) {
			continue;
		}

		iface = dvobj->padapters[i];
		mlmeext = &(iface->mlmeextpriv);

		if (MLME_IS_ASOC(iface)) {
			RTW_INFO(FUNC_ADPT_FMT" %u,%u,%u => %u,%u,%u%s\n", caller, ADPT_ARG(iface)
				 , mlmeext->cur_channel, mlmeext->cur_bwmode, mlmeext->cur_ch_offset
				 , dec_ch[i], dec_bw[i], dec_offset[i]
				 , MLME_IS_OPCH_SW(iface) ? " OPCH_SW" : "");
		} else {
			RTW_INFO(FUNC_ADPT_FMT" %u,%u,%u => %u,%u,%u%s\n", caller, ADPT_ARG(iface)
				 , cur_ie_ch[i], cur_ie_bw[i], cur_ie_offset[i]
				 , dec_ch[i], dec_bw[i], dec_offset[i]
				 , MLME_IS_OPCH_SW(iface) ? " OPCH_SW" : "");
		}
	}

	for (i = 0; i < dvobj->iface_nums; i++) {
		if (!(ifbmp & BIT(i)) || !dvobj->padapters[i]) {
			continue;
		}

		iface = dvobj->padapters[i];
		mlmeext = &(iface->mlmeextpriv);
		network = &(mlmeext->mlmext_info.network);

		/* ch setting differs from mlmeext.network IE */
		if (cur_ie_ch[i] != dec_ch[i]
		    || cur_ie_bw[i] != dec_bw[i]
		    || cur_ie_offset[i] != dec_offset[i]) {
			ifbmp_ch_changed |= BIT(i);
		}

		/* ch setting differs from existing one */
		if (MLME_IS_ASOC(iface)
		    && (mlmeext->cur_channel != dec_ch[i]
			|| mlmeext->cur_bwmode != dec_bw[i]
			|| mlmeext->cur_ch_offset != dec_offset[i])
		   ) {
			if (rtw_linked_check(iface) == _TRUE) {
#ifdef CONFIG_SPCT_CH_SWITCH
				if (1) {
					rtw_ap_inform_ch_switch(iface, dec_ch[i], dec_offset[i]);
				} else
#endif
				{
					if (rfctl->ap_csa_en == AP_CSA_DISABLE) {
						rtw_sta_flush(iface, _FALSE);
					}
				}
			}
		}

		mlmeext->cur_channel = dec_ch[i];
		mlmeext->cur_bwmode = dec_bw[i];
		mlmeext->cur_ch_offset = dec_offset[i];

		rtw_ap_update_bss_chbw(iface, network, dec_ch[i], dec_bw[i], dec_offset[i]);
	}

	return ifbmp_ch_changed;
}

static u8 rtw_ap_ch_specific_chk(_adapter *adapter, u8 ch, u8 *bw, u8 *offset, const char *caller)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);
	RT_CHANNEL_INFO *chset = rfctl->channel_set;
	int ch_idx;
	u8 ret = _SUCCESS;

	ch_idx = rtw_chset_search_ch(chset, ch);
	if (ch_idx < 0) {
		RTW_WARN("%s ch:%u doesn't fit in chplan\n", caller, ch);
		ret = _FAIL;
		goto exit;
	}
	if (chset[ch_idx].flags & RTW_CHF_NO_IR) {
		RTW_WARN("%s ch:%u is passive\n", caller, ch);
		ret = _FAIL;
		goto exit;
	}

	rtw_adjust_chbw(adapter, ch, bw, offset);

	if (!rtw_get_offset_by_chbw(ch, *bw, offset)) {
		RTW_WARN("%s %u,%u has no valid offset\n", caller, ch, *bw);
		ret = _FAIL;
		goto exit;
	}

	while (!rtw_chset_is_chbw_valid(chset, ch, *bw, *offset, 0, 0)
	       || (rtw_rfctl_dfs_domain_unknown(rfctl) && rtw_chset_is_dfs_chbw(chset, ch, *bw, *offset))
	      ) {
		if (*bw > CHANNEL_WIDTH_20) {
			(*bw)--;
		}
		if (*bw == CHANNEL_WIDTH_20) {
			*offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE;
			break;
		}
	}

	if (rtw_rfctl_dfs_domain_unknown(rfctl) && rtw_chset_is_dfs_chbw(chset, ch, *bw, *offset)) {
		RTW_WARN("%s DFS channel %u can't be used\n", caller, ch);
		ret = _FAIL;
		goto exit;
	}

exit:
	return ret;
}

static bool rtw_ap_choose_chbw(_adapter *adapter, u8 sel_ch, u8 max_bw, u8 cur_ch
			       , u8 *ch, u8 *bw, u8 *offset, bool by_int_info, u8 mesh_only, const char *caller)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);
	bool ch_avail = _FALSE;

#if defined(CONFIG_DFS_MASTER)
	if (!rtw_rfctl_dfs_domain_unknown(rfctl)) {
		if (rfctl->radar_detected
		    && rfctl->dbg_dfs_choose_dfs_ch_first
		   ) {
			ch_avail = rtw_choose_shortest_waiting_ch(rfctl, sel_ch, max_bw
					, ch, bw, offset
					, RTW_CHF_DFS, 0
					, cur_ch, by_int_info, mesh_only);
			if (ch_avail == _TRUE) {
				RTW_INFO("%s choose 5G DFS channel for debug\n", caller);
				goto exit;
			}
		}

		if (rfctl->radar_detected
		    && (rfctl->dfs_ch_sel_e_flags || rfctl->dfs_ch_sel_d_flags)
		   ) {
			ch_avail = rtw_choose_shortest_waiting_ch(rfctl, sel_ch, max_bw
					, ch, bw, offset
					, rfctl->dfs_ch_sel_e_flags, rfctl->dfs_ch_sel_d_flags
					, cur_ch, by_int_info, mesh_only);
			if (ch_avail == _TRUE) {
				RTW_INFO("%s choose with dfs_ch_sel_ e_flags:0x%02x d_flags:0x%02x for debug\n"
					 , caller, rfctl->dfs_ch_sel_e_flags, rfctl->dfs_ch_sel_d_flags);
				goto exit;
			}
		}

		ch_avail = rtw_choose_shortest_waiting_ch(rfctl, sel_ch, max_bw
				, ch, bw, offset
				, 0, 0
				, cur_ch, by_int_info, mesh_only);
	} else
#endif /* defined(CONFIG_DFS_MASTER) */
	{
		ch_avail = rtw_choose_shortest_waiting_ch(rfctl, sel_ch, max_bw
				, ch, bw, offset
				, 0, RTW_CHF_DFS
				, cur_ch, by_int_info, mesh_only);
	}
#if defined(CONFIG_DFS_MASTER)
exit:
#endif
	if (ch_avail == _FALSE) {
		RTW_WARN("%s no available channel\n", caller);
	}

